{
  "experiencia": [
    "Desarrollador Web con sólidos conocimientos en creación y optimización de sitios web",
    "Desarrollador Full Stack con experiencia en el desarrollo y mantenimiento de aplicaciones web utilizando JavaScript, Node.js, y REST APIs",
    "Colaboración en equipo aplicando buenas prácticas y metodologías ágiles como SCRUM",
    "Desarrollo integral abarcando tanto el backend como el frontend con tecnologías como React, Node.js y FastAPI",
    "Profesor de Git y GitHub en una empresa tecnológica, para la introducción del sistema de versiones entre sus programadores"
  ],
  "habilidades": [
    "JavaScript, Node.js, React, CSS, HTML",
    "FastAPI, Python, SQL, NoSQL",
    "Trabajo en equipo, Comunicación efectiva, Creatividad, Adaptabilidad",
    "Metodologías ágiles (SCRUM), Control de versiones con Git y GitHub",
    "Testing: Cypress, Selenium",
    "Three.js que es un framework para crear gráficos 3D en el navegador"
  ],
  "softskills": [
    "Trabajo en equipo",
    "Comunicación efectiva",
    "Creatividad",
    "Adaptabilidad",
    "Innovador",
    "Autonomía",
    "Proactividad",
    "Trabajo bajo presión",
    "Solución de problemas"
  ],
  "educacion": [
    "Campus Dual TIC: Bootcamp AI Engineering",
    "Programas avanzados en arquitectura de microservicios y desarrollo ágil (Octubre 2024)",
    "Google AdWords y sus aplicaciones publicitarias (Enero 2024)",
    "Three.js - Desarrollo 3D en el navegador (Agosto 2023)",
    "Hack a Boss - Bootcamp Programación Web Full Stack (Enero-Julio 2023)",
    "Neetwork Business School - Derecho Informático Internacional (Enero 2023)",
    "Neetwork Business School - Gestión y Diseño Wordpress (Diciembre 2022)",
    "Iniciación a la Creación de Páginas Web (Diciembre 2022)"
  ],
  "proyectos": [
    "Este portfolio web (es decir, yo) fue creado con React, CSS, FastAPI, Python, Supabase, con el CV en un sistema Retrieval-Augmented Generation (RAG), desplegado en Vercel",
    "Desarrolló una aplicación web Full Stack (Xtreme), abarcando tanto backend como frontend utilizando React, Node.js y mySQL CSS, con gestión de usuarios e imágenes por user-admin",
    "FacturIA es una aplicación web que permite a los usuarios guardar en sus bases de datos de Supabase sus servicios de manera automática y sencilla, evitando la tediosa tarea de tener que escribirlos manualmente y cometer fallos de tipeo, desplegando en Google Cloud"
  ],
  "idiomas": [
    "Español (Nativo)",
    "Inglés (C1), capaz de hablar, leer, escribir. Vivió en Manchester 5 años",
    "Portugués (Básico)"
  ],
  "lugar": [
    "Lugar de nacimiento: Medellín, Colombia",
    "Lugar de residencia actual: Vigo, España"
  ],
  "preferencias": [
    "Horario flexible",
    "Disponibilidad en remoto o en Vigo, España"
  ],
  "intereses": [
    "Programación, desarrollo web, inteligencia artificial, videojuegos, cine, series, música, deporte, viajar, conocer gente, aprender cosas nuevas"
  ],
  "links": [
    "LinkedIn: https://www.linkedin.com/in/julianalz/",
    "GitHub: https://github.com/Julalz"
  ],
  "lugares donde ha vivido": [
    "Vigo, Manchester, Madrid, Las Palmas"
  ],
  "conocimientos_tecnicos_ampliados":[
    "Durante mi formación en el bootcamp AI Engineering de Campus Dual TIC, cursé un módulo introductorio sobre Big Data y fundamentos de Machine Learning. En ese contexto, trabajé con modelos de aprendizaje supervisado",
    "Redes Neuronales: Actualmente no tengo experiencia práctica ni conocimientos profundos sobre redes neuronales. Es un tema que todavía no he explorado en mis proyectos ni en mi formación. Sin embargo, tengo interés en el área de la inteligencia artificial y planeo aprender sobre redes neuronales en el futuro como parte de mi desarrollo profesional continuo.",
    "Librerías IA: Hasta ahora, mi experiencia con herramientas de IA se ha centrado principalmente en **LangChain**, una biblioteca que facilita la creación de aplicaciones que integran modelos de lenguaje. La he utilizado para desarrollar proyectos de procesamiento de lenguaje natural y crear flujos de trabajo con cadenas de transformaciones de texto, integrando APIs y conectores para diversos servicios. Aunque mi experiencia con LangChain es aún limitada, he aprendido a aprovechar su versatilidad para desarrollar soluciones sencillas y eficientes. Planeo seguir explorando LangChain y otras herramientas conforme avance en el campo de la inteligencia artificial.",
    "Integración Frontend y Backend:En mis proyectos, gestiono la integración entre el frontend y el backend utilizando tecnologías como **React** para el frontend, **Node.js** y **FastAPI** para el backend, y **MySQL** para la base de datos. Me encargo de que ambos lados se comuniquen de forma eficiente utilizando **APIs RESTful** que permiten que el frontend se conecte con el backend de manera sencilla y escalable. Para gestionar los datos de manera efectiva, utilizo **JSON** para el intercambio de información entre cliente y servidor, lo que facilita la transmisión de datos complejos. \n\nUno de los desafíos que enfrento en este tipo de integración es garantizar que las solicitudes y respuestas entre el frontend y el backend se realicen de forma rápida y sin errores, lo que implica una correcta validación de los datos y manejo de errores tanto en el lado del cliente como en el servidor. Además, siempre trato de implementar prácticas de seguridad, como la **autenticación JWT** para proteger las rutas y recursos sensibles del servidor.",
    "Motivación como IA Engineer:Aunque no soy un **IA Engineer** en el sentido tradicional, lo que me apasiona de trabajar en el campo de la inteligencia artificial es la **capacidad de transformar datos en soluciones útiles** y la **posibilidad de automatizar tareas complejas** que mejoran la vida de las personas. Me interesa especialmente el área de **procesamiento de lenguaje natural** (NLP) y cómo se pueden crear aplicaciones inteligentes que comprendan y respondan a las necesidades humanas. Además, me entusiasma la idea de aplicar IA en proyectos reales que puedan hacer más eficientes las operaciones en diversos sectores. Mi motivación principal es seguir aprendiendo sobre IA y sus aplicaciones prácticas, como lo hice al trabajar con **LangChain** y ademas de este Portfolio que integra un Modelo de inteligencia artificial  y espero continuar profundizando en el área para implementar soluciones innovadoras."
  ]
}
